backend/test/load/relatorio_A.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: load_test_A.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 5m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 10 VUs  0m01.0s/5m0s

running (0m02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m02.0s/5m0s

running (0m03.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m03.0s/5m0s

running (0m04.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m04.0s/5m0s

running (0m05.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m05.0s/5m0s

running (0m06.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m06.0s/5m0s

running (0m07.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m07.0s/5m0s

running (0m08.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m08.0s/5m0s

running (0m09.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m09.0s/5m0s

running (0m10.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m10.0s/5m0s

running (0m11.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m11.0s/5m0s

running (0m12.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m12.0s/5m0s

running (0m13.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m13.0s/5m0s

running (0m14.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m14.0s/5m0s

running (0m15.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m15.0s/5m0s

running (0m16.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m16.0s/5m0s

running (0m17.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m17.0s/5m0s

running (0m18.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m18.0s/5m0s

running (0m19.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m19.0s/5m0s

running (0m20.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m20.0s/5m0s

running (0m21.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m21.0s/5m0s

running (0m22.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m22.0s/5m0s

running (0m23.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m23.0s/5m0s

running (0m24.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m24.0s/5m0s

running (0m25.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m25.0s/5m0s

running (0m26.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m26.0s/5m0s

running (0m27.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m27.0s/5m0s

running (0m28.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m28.0s/5m0s

running (0m29.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m29.0s/5m0s

running (0m30.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m30.0s/5m0s

running (0m31.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m31.0s/5m0s

running (0m32.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default ✗ [  11% ] 10 VUs  0m32.0s/5m0s

     █ Upload Research

     █ Get Research Status

     █ Delete Research

     █ Update Research

     █ Vote Research

     █ Get All Researches

     █ Distribute Research

     data_received..................: 1.5 MB 47 kB/s
     data_sent......................: 292 kB 9.1 kB/s
     group_duration.................: avg=47.81ms min=659.41µs med=7.53ms max=5.66s   p(90)=18.22ms p(95)=52.8ms 
     http_req_blocked...............: avg=10.94µs min=0s       med=1µs    max=1.63ms  p(90)=5µs     p(95)=7µs    
     http_req_connecting............: avg=3.96µs  min=0s       med=0s     max=913µs   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=47.57ms min=532µs    med=7.29ms max=5.66s   p(90)=18.15ms p(95)=52.76ms
       { expected_response:true }...: avg=8.79ms  min=623µs    med=5.77ms max=71.07ms p(90)=11.64ms p(95)=23ms   
     http_req_failed................: 58.04% ✓ 830       ✗ 600 
     http_req_receiving.............: avg=21.68µs min=6µs      med=17µs   max=234µs   p(90)=34µs    p(95)=54.54µs
     http_req_sending...............: avg=12.72µs min=1µs      med=6µs    max=605µs   p(90)=21µs    p(95)=31µs   
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s     max=0s      p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=47.54ms min=491µs    med=7.26ms max=5.66s   p(90)=18.13ms p(95)=52.75ms
     http_reqs......................: 1430   44.687789/s
     iteration_duration.............: avg=1.07s   min=1.03s    med=1.05s  max=1.41s   p(90)=1.09s   p(95)=1.16s  
     iterations.....................: 200    6.25004/s
     vus............................: 10     min=10      max=10
     vus_max........................: 10     min=10      max=10


running (0m32.0s), 00/10 VUs, 200 complete and 10 interrupted iterations
default ✗ [  11% ] 10 VUs  0m32.0s/5m0s